import { useNavigate, useParams } from 'react-router';
import { S } from './Success.style';
import illust from '../../assets/successpage/job_consultant.png';

const Success = () => {
    const { id } = useParams();
    const navigate = useNavigate();
    const titles = ['"나는 대한민국의 엄마입니다"', '', ''];
    const names = ['김미현(가명)', '', ''];
    const urls = [
        'https://saeil.mogef.go.kr/hom/center/caseview.do?base=case&seq=5401',
        '',
        '',
    ];
    const texts = [
        [
            '세상은 내가 가지고 있는 모든 것을 빼앗으려고 하는 듯했다.\n\n타 지역에 살다가 결혼과 동시에 남편을 따라 기댈 곳 없는 공주로 이사를 왔다. 남자아이 셋을 키우면서 중간중간 경력단절 기간은 있었지만, 경제적인 문제로 꾸준히 일했으며 그 누구보다 열심히 살았다고 생각했다. 하지만 잦은 사업 실패로 남편은 조금씩 변해 가기 시작했고, 결국 나는 결혼한 지 14년 만에 이혼을 선택하게 되었다.\n\n실패한 인생이라고 낙인될까 봐 소리 없이 늘 노력했고, 아빠 없는 아이라는 소리를 듣지 않을까 남들보다 아이들에게 더 신경을 썼다. 하지만 세상은 내가 가지고 있는 모든 것을 빼앗으려고 하는 듯했다. 둘째 아이의 잦은 감기가 결국 폐렴이 되어 입원하게 되었고, 나는 어쩔 수 없이 회사에 조퇴와 결근을 반복할 수밖에 없었다. 정신없는 와중에 어이없는 나의 실수로 회사에서 손실을 보게 되어 더는 민폐를 끼치고 싶지 않아 사직서를 제출하였다. 그렇게 나는 아이의 병간호와 틈틈이 식당 아르바이트 일을 하면서 생활을 이어 나가고 있었다.\n\n밤낮으로 일을 하느라 내 몸과 마음은 점점 지쳐가고 있을 때였다. 일찍 철들어 버린 아이들은 나를 도와주겠다고 집안일을 하다가 막내아이까지 다리를 다치게 되었다. 아이들을 위해서라면 닥치는 대로 무엇이든 하겠다고 이 악물고 했지만, 지금 내가 무엇을 하고 있는지 막막한 현실 앞에 내 다짐과 각오들이 모두 무너졌다. 한 치 앞도 보이지 않는 현실에 모든 것을 내려놓고 싶었다.\n그때 한 통의 전화가 걸려 왔다. 전에 다니던 직장을 알선하여 주신 담당 취업상담사님이었따.\n\n지금도 이유는 모르겠지만, 상담사님 목소리에 울컥 눈물이 쏟아질 것 같았다. 오랜만의 전화 통화였지만 어색하지 않았고, 여전히 따뜻한 목소리로 나의 안부를 물어왔다. 지금까지 있던 일을 어찌 말로 다 할 수 있을까 싶었지만, 몇 번의 상담 후 나도 모르게 상담사님에게 의지하며 모든 이야기를 하고 있었다. 어쩌면 나는 누군가에게 하소연이라는 걸 하고 싶었는지도 모르겠다.',
            '이후 상담사님은 변함없이 나의 안부와 심리상담의 권유 등으로 나를 찾아 주셨고, 여러 번의 고민 끝에 심리상담이 진행되었다. 얼마나 상담이 진행되었을까? 가슴에 있는 응어리가 조금씩 치료되고 있음을 느꼈다. 그렇게 나는 담당 상담사님과 내 삶을 공유하며 긍정적인 생각을 할 수 있었고, 자신감을 찾아갔다. 지속적인 관심과 지원하려는 업체에 대한 정보를 수시로 주셨고, 이력서와 자기소개서 등 컨설팅을 해주셨다. 그럼에도 불구하고, 나는 취업에 계속 실패했고, 나중에는 담당 상담사님께 너무 죄송한 마음뿐이었다. 하지만 그럴수록 상담사님은 이미지 메이킹, 면접 스킬 등을 배울 수 있도록 기회를 주셨으며, 끝까지 내가 포기하지 않도록 용기를 북돋아 주셨다.\n\n드디어 나에게도 기회가 찾아왔다. 아이들의 학교 근처에 짧은 기간제 근무이지만, 회계사무원을 구인 중이라며 지원해 보는 게 어떨지 물어보셨다. 집과 학교가 가까워 아이들도 보살피기 좋을 것 같다고 도전해 볼 것을 권유하셨다. 지금까지 차근차근 잘 준비하였 기에 망설임 없이 지원하였고, 담당 선생님께서 전달해 준 정보도 꼼꼼히 살 피면서 면접을 준비하였다. 마침내 면접 날이 다가왔다. 이번만은 꼭 성공하 리라는 마음으로 인사담당자의 질문에 성실히 답변하였으며, 그결과 취업에 성공하였다.\n\n그로부터 몇 개월이 지난 지금 나는 정규직으로 전환이 되었다. 또한, 나의 어려운 사정을 전해 들은 사장님께서는 아이들과 같이 출근할 수 있도록 배 려해주셨으며, 탄력 근무제, 유연근무제를 도입하여 모든 직원이 이용할 수 있도록 해주셨다. 수업이 끝나고 자연스럽게 사무실로 들어오는 아이들을 보 면 일에 대한 책임감과 삶에 대한 애착이 생겼으며, 책임감과 성실함으로 회사에 보답해야겠다는 생각이 들어 더 열심히 생활하고 있다. 그렇게 나는 오늘도 즐거운 발걸음으로 아이들과 함께 퇴근한다.\n\n사람들은 자기에게 처한 현실이 남들보다 더 힘들다고 생각한다. 나 역시 그 렇게 시간을 보내왔다. 하지만 담당 상담사를 만나고부터는 어떤 어려움이 있어도 잘 할 수 있고, 또 잘 될 거라는 긍정적인 생각을 하게 되었다. 앞으로 도 아이들과 내 남은 인생을 위해 그렇게 살아갈 것이다.\n\n마지막으로 취업 후에도 잊지 않고 연락해 주시고, 지치고 힘들 때마다 언니처럼, 엄마처럼 따뜻하게 보살펴주시고 격려해주시는 담당 선생님께 다시 한번 감사의 인사를 전합니다. 앞으로도 당당한 대한민국의 엄마로 살아가도록 노력하겠습니다.\n\n새일을 시작합니다. 경력이 이어집니다.',
        ],
        ['', ''],
        ['', ''],
    ];
    return (
        <S.Wrapper>
            <S.TitleBox>
                <S.Category>성공 사례</S.Category>
                <S.Title>{titles[id - 1]}</S.Title>
                <div style={{ display: 'flex' }}>
                    <S.SubInfo>{names[id - 1]}</S.SubInfo>
                    <S.SubInfo>읽기 3분 소요</S.SubInfo>
                    <S.SubInfo>
                        출처: <a href={urls[id - 1]}>{urls[id - 1]}</a>
                    </S.SubInfo>
                </div>
            </S.TitleBox>
            <S.TextBox>
                <S.Text>{texts[id - 1][0]}</S.Text>
            </S.TextBox>
            <S.Image src={illust} />
            <S.TextBox>
                <S.Text>{texts[id - 1][1]}</S.Text>
            </S.TextBox>
            <S.GreenBtn onClick={() => navigate('/')}>메인 화면으로</S.GreenBtn>
        </S.Wrapper>
    );
};

export default Success;
